// JSON structure for Scout Safeguarding Document
// To be used with React Native Paper

{
  metadata: {
    title: "Safeguarding Code of Conduct for Adults",
    version: "8. 1st January 2024",
    website: "scouts.org.uk/safeguarding"
  },
  headerSection: {
    type: "header",
    backgroundColor: "#ffde00", // Yellow background color
    content: [
      {
        type: "text",
        text: "Safeguarding",
        style: { fontWeight: "bold", fontSize: 24 }
      },
      {
        type: "text",
        text: "Code of Conduct for Adults",
        style: { fontSize: 18 }
      },
      {
        type: "text",
        text: "In Scouts, the welfare of children and young people is our priority. Everyone has a duty to report safeguarding concerns, and all adults must follow this Safeguarding Code of Conduct."
      },
      {
        type: "text",
        text: "Children and young people first. If in doubt, report it.",
        style: { fontWeight: "bold" }
      },
      {
        type: "text",
        text: "Find out more at scouts.org.uk/safeguarding"
      }
    ]
  },
  sections: [
    {
      type: "section",
      title: "If a child or young person tells you about a concern, you must do the following.",
      steps: [
        {
          number: 1,
          text: "Allow them to speak without interruption, and accept what they say."
        },
        {
          number: 2,
          text: "Be understanding and reassuring, but do not give your opinion."
        },
        {
          number: 3,
          text: "Tell them you will try to help but must pass the information on."
        },
        {
          number: 4,
          text: "Write careful notes of what was said using the actual words used. Don't ask leading questions or try to find out whether the concern is justified."
        },
        {
          number: 5,
          text: "Make sure that Scout activities do not cause further risk to their welfare."
        },
        {
          number: 6,
          text: "Contact the Safeguarding Team."
        }
      ]
    },
    {
      type: "section",
      title: "If you are concerned about the welfare of a child or young person, or if there is a concern, complaint or allegation, about you or another adult, inside or outside of Scouts, you must do the following.",
      steps: [
        {
          number: 1,
          text: "Write careful notes of what was said using the actual words used."
        },
        {
          number: 2,
          text: "Do not ask leading questions or try to find out whether the concern is justified."
        },
        {
          number: 3,
          text: "Make sure that Scouting does not cause further risk to your or their welfare."
        },
        {
          number: 4,
          text: "Contact the Safeguarding Team."
        }
      ]
    },
    {
      type: "section",
      title: "Procedure for reporting safeguarding concerns",
      steps: [
        {
          number: 1,
          text: "Gather the necessary information",
          bullets: [
            "Make sure that you have the name, date of birth, address and phone number of each person involved with the concern.",
            "Find out when the people involved will next be at a Scout meeting or activity."
          ]
        },
        {
          number: 2,
          text: "Contact the Safeguarding Team",
          bullets: [
            "Use the reporting form on the Scouts website to report the concern to the Safeguarding Team. Include as much information as possible.",
            "If you can't fill in the form online, call +44(0)20 8433 7164 (9am to 5pm, Monday to Friday) or email safeguarding@scouts.org.uk",
            "In an emergency outside the above times, you can contact the Safeguarding Team by calling the Scouts Support Centre on +44(0)345 300 1818.",
            "Follow the Safeguarding Team's advice and take no further action unless they tell you to.",
            "Ask questions if you're not sure what to do."
          ]
        }
      ],
      footer: {
        type: "text",
        text: "It is your duty to report all safeguarding concerns, whether you are told about them directly or indirectly, as soon as possible (always within 24 hours). If you are not sure what to do, or you are not sure if a concern has been reported, contact the Safeguarding Team.",
        style: { fontWeight: "medium" }
      }
    },
    {
      type: "alert",
      backgroundColor: "#ffde00", // Yellow background color
      borderColor: "#000000",
      content: [
        {
          type: "text",
          text: "If a child or young person is at immediate risk of harm, call 999 or 112 and ask for the police.",
          style: { fontWeight: "bold" }
        },
        {
          type: "text",
          text: "Tell the Safeguarding Team you have done this."
        },
        {
          type: "text",
          text: "You can also call the NSPCC on 0808 800 5000 or email them at help@nspcc.org.uk"
        }
      ]
    },
    {
      type: "section",
      title: "Code of conduct",
      behavioursList: [
        "Do remember that you are a role model at all times, inside and outside of Scouts. You must set a good example for others to follow.",
        "Do treat everyone with dignity and respect in line with the Scout Values.",
        "Do treat all young people equally – do not show favouritism",
        "Do follow the adult-to-young-people ratios at all times.",
        "Do remember that you have been placed in a position of trust – do not abuse this trust.",
        "Do report all safeguarding concerns directly to the Safeguarding Team as soon as possible, and always within 24 hours",
        "Do contact the Safeguarding Team if you receive details of any statutory agency (for example, the police, the Local Authority Designated Officer (LADO) or children's services) involvement regarding a member.",
        "Do remember that someone may misinterpret your actions.",
        "Do respect children's and young people's right to personal privacy.",
        "Do act within appropriate boundaries, even in difficult circumstances.",
        "Do encourage an open and transparent culture, where people challenge or report behaviour that is not in line with this code.",
        "Do make everyone aware of our safeguarding arrangements. Share our Yellow Card with volunteers, parents and guardians, and display it where meetings take place.",
        "Do create an environment where children and young people feel safe and able to voice their concerns.",
        "Do have separate sleeping accommodation for young people and adults, as well as young leaders working with a younger section.",
        "Do plan activities that involve more than one other person being present. If that's not possible, make sure other people can see and hear what's going on.",
        "Do not plan to be alone with a child or young person in Scouts, either online or in person.",
        "Do not drink alcohol when you are directly responsible for children and young people in Scouts, and never allow under 18s to drink alcohol on Scout activities",
        "Do not trivialise concerns or abuse.",
        "Do not let concerns or abuse go unreported. Contact the Safeguarding Team, especially if you feel your concern has not been taken seriously.",
        "Do not join in physical contact games with children and young people.",
        "Do not overstep the boundaries with children and young people by being involved in friendships or personal relationships with them.",
        "Do not allow activities that encourage bullying behaviour, including initiation ceremonies, dares or forfeits.",
        "Do not use inappropriate, suggestive or threatening language, whether verbal, written or online.",
        "Do not rely on your reputation or position to protect you.",
        "Do not get involved with a safeguarding concern if you have a personal friendship or family connection with those involved. Step back and tell the Safeguarding Team about the connection."
      ]
    }
  ],
  footer: {
    type: "footer",
    backgroundColor: "#ffde00", // Yellow background color
    content: [
      {
        type: "text",
        text: "scouts.org.uk/safeguarding"
      },
      {
        type: "text",
        text: "Version 8. 1st January 2024"
      },
      {
        type: "image",
        source: "crystal_mark_logo",
        description: "Crystal Mark. 21734. Clarity Approved by Plain English Campaign"
      }
    ]
  }
};

export default scoutSafeguardingDocument;